import React from 'react';
import './Use.css';

class Uses extends React.Component {
  render() {
    return (
      <div className='useuse'>
        <h1>이용약관</h1>
        <h6>제1조 목적</h6>
        <li class="dan">이 약관은 알고킹(이하 "회사"라고 합니다)에서  제공하는 인터넷 관련 서비스를 이용함에 있어 홈페이지와 이용자의 권리·의무 및 책임사항을 규정함을 목적으로 합니다.</li>

        <h6>제2조 용어의 정의</h6>
        <li>이 약관에서 사용하는 용어의 정의는 다음과 같습니다. 여기에서 정의되지 않은 이 약관상의 용어의 의미는 일반적인 관행에 따릅니다.</li>
        <ul2>
          <li>"서비스"란 회사가 알고킹에서 제공하는, 구현되는 단말기와 상관없이 회원 혹은 웹사이트 방문자가 이용할 수 있는 서비스를 말합니다.</li>
          <li>"회원"이란 이 약관에 따라 회사에서 제공하는 서비스에 접속하여 계속적으로 이용할 수 있는 사람을 말합니다.</li>
          <li>"백준 온라인 저지"란 주식회사 스타트링크가 acmicpc.net 홈페이지에서 제공하는 백준 온라인 저지 서비스를 말합니다.</li>
          <li>"연동"이란 백준 온라인 저지의 이용 약관에 따라 백준 온라인 저지와의 이용 계약을 체결한 회원이, 회사에게 개인정보를 제공하여 등록하는 것을 말합니다.</li>
          <li>"게시물"이란 회원이 서비스를 이용하면서 게시한 글, 사진, 각종 파일과 링크, 디지털 콘텐츠 등을 말합니다.</li>
        </ul2>


<h6>제3조 약관의 명시와 설명 및 개정</h6>
<li>
  회사는 이 약관의 내용과 상호 및 대표자 성명, 영업소 소재지 주소, 전화번호, 전자우편주소, 사업자등록번호, 통신판매업신고번호, 개인정보관리책임자 등을 회원이 쉽게 확인할 수 있도록 알고킹의 초기 서비스 화면에 게시합니다. 다만, 약관의 구체적 내용은 회원이 연결 화면을 통하여 볼 수 있도록 할 수 있습니다.
</li>
<li>
  회사는 『전자상거래 등에서의 소비자보호에 관한 법률』, 『약관의 규제에 관한 법률』, 『전자문서 및 전자거래기본법』, 『전자금융거래법』, 『전자서명법』, 『정보통신망 이용촉진 및 정보보호 등에 관한 법률』, 『소비자기본법』 등 관련 법령을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.
</li>
<li>
  회사가 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 현행 약관과 함께 서비스의 화면에 그 적용일자 7일(다만, 회원에게 불리한 내용으로 변경하는 경우에는 30일) 이전부터 적용일자 전일까지 공지합니다.
</li>
<li>
  제3항에 의해 변경된 약관은 관련 법령에 특별한 규정 기타 부득이한 사유가 없는 한 그 적용일자 이전으로 소급하여 적용되지 않습니다.
</li>
<li>
  제3항에 따라 공지된 적용일자 이후에 회원이 명시적으로 거부 의사를 표명하지 않을 경우에는 개정된 약관에 동의하는 것으로 간주합니다. 변경된 약관에 동의하지 않는 회원은 회원 탈퇴를 요청할 수 있습니다.
</li>
<li>
  제3항의 조치에도 불구하고 약관의 개정 사실을 알지 못함으로써 발생하는 회원의 피해에 대하여 회사는 책임을 지지 않습니다.
</li>
<li>
  회사는 필요한 경우 서비스 내의 개별항목에 대하여 개별약관 또는 운영원칙(이하 "서비스 별 안내"라 합니다)를 정할 수 있으며, 회원은 각 서비스 별 안내에 대해 연동과 동시에 동의한 것으로 간주합니다. 본 약관과 서비스 별 안내의 내용이 상충되는 경우에는 서비스 별 안내의 내용을 우선하여 적용합니다.
</li>

<h6>제4조 서비스의 제공 및 변경</h6>
<li>
  회사는 회원에게 아래와 같은 서비스를 제공합니다.
</li>
<ul2>
  <li>프로그래밍 문제들의 난이도 및 분류 정보 제공</li>
  <li>프로그래밍 문제들의 난이도 및 분류에 대한 의견을 제시할 수 있는 커뮤니티 서비스</li>
  <li>재화 또는 용역에 대한 정보 제공 및 구매계약의 체결</li>
  <li>구매계약이 체결된 재화 또는 용역의 배송</li>
  <li>기타 회사가 정하는 서비스 또는 업무</li>
</ul2>
<li>
  서비스는 회사의 업무상 또는 기술상 특별한 지장이 없는 한 연중무휴, 1일 24시간 운영을 원칙으로 합니다.
</li>
<li>
  회사는 일부 서비스의 이용 가능 시간을 별도로 정할 수 있습니다. 이 경우 서비스 이용안내를 통해 공지합니다.
</li>
<li>
  회사는 재화 또는 용역의 품절 또는 기술적 사양의 변경 등의 경우에는 장차 체결되는 계약에 의해 제공할 재화 또는 용역의 내용을 변경할 수 있습니다. 이 경우에는 변경된 재화 또는 용역의 내용 및 제공일자를 명시하여 현재의 재화 또는 용역의 내용을 게시한 곳에 즉시 공지합니다.
</li>
<li>
  서비스가 제공하기로 이용자와 계약을 체결한 서비스의 내용을 재화등의 품절 또는 기술적 사양의 변경 등의 사유로 변경할 경우에는 그 사유를 이용자에게 통지 가능한 주소로 즉시 통지합니다.
</li>
<li>
  전항의 경우 회사는 이로 인하여 이용자가 입은 손해를 배상합니다. 다만, 회사가 고의 또는 과실이 없음을 입증하는 경우에는 그러하지 않습니다.
</li>
<h6>제5조 서비스의 중단</h6>
      <li>
        회사는 천재지변 또는 이에 준하는 불가항력, 컴퓨터 등 정보통신설비의 보수점검·교체, 고장, 통신의 두절 등의 사유가 발생한 경우에는 서비스의 제공을 일시적으로 중단할 수 있습니다.
      </li>
      <li>
        회사는 제1항의 사유로 서비스의 제공이 일시적으로 중단됨으로 인하여 회원이 입은 손해에 대하여 배상합니다. 단, 회사가 고의 또는 과실이 없음을 입증하는 경우에는 그러하지 않습니다.
      </li>
      <li>
        사업종목의 전환, 사업의 포기, 업체 간의 통합 등의 이유로 서비스를 제공할 수 없게 되는 경우에는 회사는 제8조에 정한 방법으로 이용자에게 통지하고 당초 회사에서 제시한 조건에 따라 소비자에게 보상합니다. 다만, 회사가 보상기준 등을 고지하지 아니한 경우에는 이용자들의 마일리지 또는 적립금 등을 회사에서 통용되는 통화가치에 상응하는 현물 또는 현금으로 이용자에게 지급합니다.
      </li>

      <h6>제6조 연동 및 회원가입</h6>
      <li>
        회원가입을 희망하는 사람은 연동을 마치고, 이 약관에 동의한다는 의사를 표시함으로서 회원가입을 신청합니다.
      </li>
      <li>
        회사는 제1항과 같이 회원으로 가입할 것을 신청한 사람 중 다음 각 호에 해당하지 않는 한 회원으로 등록합니다.
      </li>
      <ul2>
        <li>가입신청자가 이 약관에 의하여 이전에 회원자격을 상실한 적이 있는 경우</li>
        <li>기타 가입신청자를 회원으로 등록하는 것이 기술상 불가능하거나, 서비스의 운영 또는 유지·관리에 현저한 지장을 준다고 판단되는 경우</li>
      </ul2>
      <li>
        회원가입의 성립 시기는 서비스의 가입 절차에 따라 승인이 완료되는 시점으로 합니다.
      </li>
      <h6>제7조 회원 탈퇴 및 자격 상실 등</h6>
      <li>
        회원은 회사에 언제든지 탈퇴를 요청할 수 있습니다. 회사는 회원의 회원탈퇴 요청 즉시 회원탈퇴를 처리합니다. 단, 회원탈퇴 시 소멸되지 않은 재화 등이 있는 경우에 이에 대한 권리를 포기한 것으로 간주하여, 탈퇴와 동시에 전부 소멸됩니다.
      </li>
      <li>
        회원이 다음 각 호의 사유에 해당하는 경우, 회사는 회원의 자격을 제한 또는 상실시킬 수 있습니다.
      </li>
      <ul2>
        <li>다른 사람의 서비스 이용을 방해하거나 그 정보를 도용한 경우</li>
        <li>서비스를 이용하여 회사의 허가 없이 영업활동을 하는 경우</li>
        <li>서비스를 이용하여 불법, 음란행위를 하는 경우</li>
        <li>기타 서비스를 이용하여 법령 또는 이 약관이 금지하거나 공서양속에 반하는 행위를 하는 경우</li>
      </ul2>
      <li>
        회사는 제2항에 따라 회원의 자격을 제한하는 경우에는 그 사유 및 제한기간 등을 회원에게 알려야 합니다.
      </li>
      <li>
        회원은 본 조에 따른 이용제한 등에 대해 회사가 정한 절차에 따라 이의신청을 할 수 있습니다. 이 때 이의가 정당하다고 회사가 인정하는 경우 회사는 즉시 서비스의 이용을 재개합니다.
      </li>
      <li>
        회원탈퇴 또는 회원자격 상실인 경우 회사는 회원등록을 말소합니다. 다만, 회원이 프로그래밍 문제에 대해 남긴 의견에 대한 기록이나 회원에 대한 제재 기록이 있는 경우 그 기록은 별도 보관합니다.
      </li>

      <h6>제8조 회원에 대한 통지</h6>
      <li>
        회사가 회원에 대한 통지를 하는 경우 전자우편 등으로 할 수 있습니다.
      </li>
      <li>
        회사는 불특정다수 회원에 대한 통지의 경우 백준 온라인 저지 게시판에 게시함으로서 개별 통지에 갈음할 수 있습니다.
      </li>

      <h6>제9조 회사의 의무</h6>
      <li>
        회사는 이 약관이 금지하거나 관련 법령 기타 공서양속에 반하는 행위를 하지 않으며 이 약관이 정하는 바에 따라 지속적이고, 안정적으로 서비스를 제공하는 데 최선을 다합니다.
      </li>
      <li>
        회사는 회원이 안전하게 서비스를 이용할 수 있도록 회원의 개인정보 보호를 위한 보안시스템을 갖추어야 하며, 개인정보처리방침을 공시하고 준수합니다.
      </li>
      <li>
        회사는 회원이 동의하지 않는 영리목적의 광고성 전자우편 등을 발송하지 않습니다.
      </li>
      <li>
        회사는 회원으로부터 제기되는 의견이나 불만이 객관적으로 정당하다고 인정될 경우에는 회원의 불만을 해결하기 위해 노력합니다.
      </li>

      <h6>제10조 회원의 의무</h6>
      <li>
        회원은 이 약관의 규정, 회사의 이용정책, 이용안내 사항 및 관련 법령 등을 준수하여야 하며, 기타 회사 업무에 방해되는 행위를 하여서는 안 됩니다.
      </li>
      <li>
        회원은 다음 각 호의 행위를 하여서는 안 됩니다.
      </li>
      <ul2>
        <li>신청 또는 변경 시 허위내용의 등록</li>
        <li>타인의 정보 도용</li>
        <li>회사와 기타 제3자의 저작권 등 지적재산권에 대한 침해 행위</li>
        <li>회사 및 기타 제3자의 명예를 손상시키거나 업무를 방해하는 행위</li>
        <li>외설 또는 폭력적인 메시지, 화상, 음성, 기타 공서양속에 반하는 정보를 서비스에 공개 또는 게시하는 행위</li>
        <li>회사의 동의 없이 영리를 목적으로 서비스를 사용하는 행위</li>
      </ul2>
      <li>
        본 조 제2항의 구체적인 내용은 "AlgoKING 이용 규칙"에서 정합니다.
      </li>
      <h6>제11조 구매 신청 및 개인정보 제공 동의 등</h6>
      <li>
        이용자는 서비스 상에서 다음 또는 이와 유사한 방법에 의하여 구매를 신청하며, 서비스는 이용자가 구매신청을 함에 있어서 다음의 각 내용을 알기 쉽게 제공하여야 합니다.
      </li>
      <ol>
        <li>재화 등의 검색 및 선택</li>
        <li>받는 사람의 성명, 주소, 전화번호, 전자우편주소(또는 이동전화번호) 등의 입력</li>
        <li>약관 내용, 청약철회권이 제한되는 서비스, 배송료․설치비 등의 비용부담과 관련한 내용에 대한 확인</li>
        <li>이 약관에 동의하고 위 호의 사항을 확인하거나 거부하는 표시</li>
        <li>재화 등의 구매신청 및 이에 관한 확인 또는 회사의 확인에 대한 동의</li>
        <li>결제방법의 선택</li>
        <li>
          회사가 제3자에게 구매자 개인정보를 제공할 필요가 있는 경우 개인정보를 제공받는 자, 개인정보를 제공받는 자의 개인정보 이용목적, 제공하는 개인정보의 항목, 개인정보를 제공받는 자의 개인정보 보유 및 이용기간을 구매자에게 알리고 동의를 받아야 합니다. (동의를 받은 사항이 변경되는 경우에도 같습니다.)
        </li>
        <li>
          회사가 제3자에게 구매자의 개인정보를 취급할 수 있도록 업무를 위탁하는 경우에는 개인정보 취급위탁을 받는 자, 개인정보 취급위탁을 하는 업무의 내용을 구매자에게 알리고 동의를 받아야 합니다. (동의를 받은 사항이 변경되는 경우에도 같습니다.) 다만, 서비스제공에 관한 계약이행을 위해 필요하고 구매자의 편의증진과 관련된 경우에는 『정보통신망 이용촉진 및 정보보호 등에 관한 법률』에서 정하고 있는 방법으로 개인정보 취급방침을 통해 알림으로써 고지 절차와 동의 절차를 거치지 않아도 됩니다.
        </li>
      </ol>

      <h6>제12조 구매계약의 성립</h6>
      <li>
        회사는 제11조와 같은 구매 신청에 대하여 다음 각 호에 해당하면 승낙하지 않을 수 있습니다. 다만, 미성년자와 계약을 체결하는 경우에는 법정대리인의 동의를 얻지 못하면 미성년자 본인 또는 법정대리인이 계약을 취소할 수 있다는 내용을 고지하여야 합니다.
      </li>
      <ol>
        <li>신청 내용에 허위, 기재누락, 오기가 있는 경우</li>
        <li>미성년자가 담배, 주류 등 『청소년보호법』에서 금지하는 재화 및 용역을 구매하는 경우</li>
        <li>기타 구매신청에 승낙하는 것이 서비스 기술상 현저히 지장이 있다고 판단하는 경우</li>
      </ol>

      <h6>제13조 지급방법</h6>
      <li>
        회사에서 구매한 재화 또는 용역에 대한 대금지급방법은 다음 각 호의 방법중 가용한 방법으로 할 수 있습니다. 단, 회사는 이용자의 지급방법에 대하여 재화 등의 대금에 어떠한 명목의 수수료도 추가하여 징수할 수 없습니다.
      </li>
      <ul2>
        <li>폰뱅킹, 인터넷뱅킹, 메일 뱅킹 등의 각종 계좌이체</li>
        <li>선불카드, 직불카드, 신용카드 등의 각종 카드 결제</li>
        <li>온라인무통장입금</li>
        <li>전자화폐에 의한 결제</li>
        <li>마일리지 등 회사가 지급한 포인트에 의한 결제</li>
        <li>회사와 계약을 맺었거나 회사가 인정한 상품권에 의한 결제</li>
        <li>기타 전자적 지급 방법에 의한 대금 지급 등</li>
      </ul2>
      <h6>제14조 수신확인 통지, 구매 신청 변경 및 취소</h6>
  <li>
    회사는 이용자의 구매 신청이 있는 경우 이용자에게 수신확인통지를 합니다.
    수신확인통지를 받은 이용자는 의사표시의 불일치 등이 있는 경우에는 수신확인통지를 받은 후 즉시 구매신청 변경 및 취소를 요청할 수 있고, 회사는 배송 전에 이용자의 요청이 있는 경우에는 지체 없이 그 요청에 따라 처리하여야 합니다. 다만 이미 대금을 지불한 경우에는 제17조의 규정에 따릅니다.
  </li>

  <h6>제15조 재화 등의 공급</h6>
  <li>
    회사는 이용자와 재화 등의 공급시기에 관하여 별도의 약정이 없는 이상, 이용자가 청약을 한 날부터 7일 이내에 재화 등을 배송할 수 있도록 주문제작, 포장 등 기타의 필요한 조치를 취합니다. 다만, 회사가 이미 재화 등의 대금의 전부 또는 일부를 받은 경우에는 대금의 전부 또는 일부를 받은 날부터 3영업일 이내에 조치를 취합니다. 이때 회사는 이용자가 재화 등의 공급 절차 및 진행 사항을 확인할 수 있도록 적절한 조치를 합니다.
    회사는 이용자가 구매한 재화에 대해 배송수단, 수단별 배송비용 부담자, 수단별 배송기간 등을 명시합니다. 만약 회사가 약정 배송기간을 초과한 경우에는 그로 인한 이용자의 손해를 배상하여야 합니다. 다만 회사가 고의 및 과실이 없음을 입증한 경우에는 그러하지 않습니다.
  </li>

  <h6>제16조 환급</h6>
  <li>
    회사는 이용자가 구매신청한 재화 등이 품절 등의 사유로 인도 또는 제공을 할 수 없을 때에는 지체 없이 그 사유를 이용자에게 통지하고 사전에 재화 등의 대금을 받은 경우에는 대금을 받은 날부터 3영업일 이내에 환급하거나 환급에 필요한 조치를 취합니다.
  </li>

  <h6>제17조 청약철회 등</h6>
  <li>
    회사와 재화 등의 구매에 관한 계약을 체결한 이용자는 『전자상거래 등에서의 소비자보호에 관한 법률』 제13조 제2항에 따른 계약내용에 관한 서면을 받은 날(그 서면을 받은 때보다 재화 등의 공급이 늦게 이루어진 경우에는 재화 등을 공급받거나 재화 등의 공급이 시작된 날을 말합니다)부터 7일 이내에는 청약의 철회를 할 수 있습니다. </li> <li>다만, 청약철회에 관하여 『전자상거래 등에서의 소비자보호에 관한 법률』에 달리 정함이 있는 경우에는 동 법 규정에 따릅니다.</li> <li>
    이용자는 재화 등을 배송 받은 경우 다음 각 호의 1에 해당하는 경우에는 반품 및 교환을 할 수 없습니다.
  </li>
  <ol>
    <li>이용자에게 책임 있는 사유로 재화 등이 멸실 또는 훼손된 경우(다만, 재화 등의 내용을 확인하기 위하여 포장 등을 훼손한 경우에는 청약철회를 할 수 있습니다)</li>
    <li>이용자의 사용 또는 일부 소비에 의하여 재화 등의 가치가 현저히 감소한 경우</li>
    <li>시간의 경과에 의하여 재판매가 곤란할 정도로 재화등의 가치가 현저히 감소한 경우</li>
    <li>같은 성능을 지닌 재화 등으로 복제가 가능한 경우 그 원본인 재화 등의 포장을 훼손한 경우</li>
  </ol>
  <li>
    제2항 제2호 내지 제4호의 경우에 회사가 사전에 청약철회 등이 제한되는 사실을 소비자가 쉽게 알 수 있는 곳에 명기하거나 시용상품을 제공하는 등의 조치를 하지 않았다면 이용자의 청약철회 등이 제한되지 않습니다.</li> <li>
    이용자는 제1항 및 제2항의 규정에 불구하고 재화 등의 내용이 표시·광고 내용과 다르거나 계약내용과 다르게 이행된 때에는 당해 재화 등을 공급받은 날부터 3월 이내, 그 사실을 안 날 또는 알 수 있었던 날부터 30일 이내에 청약철회 등을 할 수 있습니다.
  </li>

  <h6>제18조 청약철회 등의 효과</h6>
  <li>
    회사는 이용자로부터 재화 등을 반환받은 경우 3영업일 이내에 이미 지급받은 재화 등의 대금을 환급합니다.</li> <li>이 경우 회사가 이용자에게 재화 등의 환급을 지연한 때에는 그 지연기간에 대하여 『전자상거래 등에서의 소비자보호에 관한 법률 시행령』제21조의2에서 정하는 지연이자율을 곱하여 산정한 지연이자를 지급합니다.
    회사는 위 대금을 환급함에 있어서 이용자가 신용카드 또는 전자화폐 등의 결제수단으로 재화 등의 대금을 지급한 때에는 지체 없이 당해 결제수단을 제공한 사업자로 하여금 재화 등의 대금의 청구를 정지 또는 취소하도록 요청합니다.</li> <li>
    청약철회 등의 경우 공급받은 재화 등의 반환에 필요한 비용은 이용자가 부담합니다. </li> <li>회사는 이용자에게 청약철회 등을 이유로 위약금 또는 손해배상을 청구하지 않습니다. </li> <li>다만 재화 등의 내용이 표시·광고 내용과 다르거나 계약내용과 다르게 이행되어 청약철회 등을 하는 경우 재화 등의 반환에 필요한 비용은 회사가 부담합니다.</li> <li>
    이용자가 재화 등을 제공받을 때 발송비를 부담한 경우에 회사는 청약철회 시 그 비용을 누가 부담하는지를 이용자가 알기 쉽도록 명확하게 표시합니다.
  </li>
  
  <h6>부칙</h6>
  <li> 이 약관은 2023년 07월 01일부터 적용됩니다.
   </li>
  

      </div>
    );
  }
}

export default Uses;
